In [ ]:
import pandas as pd
df = pd.read_csv('/content/sample_data/sample_dataset.csv')

print(df.head())

      Name  Age         City  Marks
0    Rohan   10       Mumbai   78.0
1     John   20        Thane   90.0
2  Avinash   45  Navi Mumbai   35.0
3      Roy   34         Pune   60.0
4   Ramesh   21       Nashik   50.0

In [ ]:
print(df.isnull())

    Name    Age   City  Marks
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False  False  False   True
6  False  False  False  False
7   True  False  False  False
8  False  False  False  False

In [ ]:
df['Marks']=df['Marks'].fillna(df['Marks'].mean())

In [ ]:
print(df)

      Name  Age         City  Marks
0    Rohan   10       Mumbai   78.0
1     John   20        Thane   90.0
2  Avinash   45  Navi Mumbai   35.0
3      Roy   34         Pune   60.0
4   Ramesh   21       Nashik   50.0
5   Suresh   68    Hyderabad   59.0
6   Mahesh   37        Delhi   21.0
7      NaN   19     Banglore   98.0
8     Veer   29      Chennai   40.0

In [ ]:
df['Name'] = df['Name'].fillna('Unknown')

In [ ]:
print(df)

      Name  Age         City  Marks
0    Rohan   10       Mumbai   78.0
1     John   20        Thane   90.0
2  Avinash   45  Navi Mumbai   35.0
3      Roy   34         Pune   60.0
4   Ramesh   21       Nashik   50.0
5   Suresh   68    Hyderabad   59.0
6   Mahesh   37        Delhi   21.0
7  Unknown   19     Banglore   98.0
8     Veer   29      Chennai   40.0

In [ ]:
bins = [0,18,35,60,80]
labels = ['Child','Young Adult','Adult','Senior Citizen']

df['Age Group'] = pd.cut(df['Age'], bins=bins, labels=labels)

print(df)

      Name  Age         City  Marks       Age Group
0    Rohan   10       Mumbai   78.0           Child
1     John   20        Thane   90.0     Young Adult
2  Avinash   45  Navi Mumbai   35.0           Adult
3      Roy   34         Pune   60.0     Young Adult
4   Ramesh   21       Nashik   50.0     Young Adult
5   Suresh   68    Hyderabad   59.0  Senior Citizen
6   Mahesh   37        Delhi   21.0           Adult
7  Unknown   19     Banglore   98.0     Young Adult
8     Veer   29      Chennai   40.0     Young Adult

In [ ]:
bins = [0,40,70,100]
labels = ['Low','Medium','High']

df['Marks Category'] = pd.cut(df['Marks'], bins=bins, labels=labels)

print(df)

      Name  Age         City  Marks       Age Group Marks Category
0    Rohan   10       Mumbai   78.0           Child           High
1     John   20        Thane   90.0     Young Adult           High
2  Avinash   45  Navi Mumbai   35.0           Adult            Low
3      Roy   34         Pune   60.0     Young Adult         Medium
4   Ramesh   21       Nashik   50.0     Young Adult         Medium
5   Suresh   68    Hyderabad   59.0  Senior Citizen         Medium
6   Mahesh   37        Delhi   21.0           Adult            Low
7  Unknown   19     Banglore   98.0     Young Adult           High
8     Veer   29      Chennai   40.0     Young Adult            Low

In [ ]:
print(df['Marks'])

0    78.0
1    90.0
2    35.0
3    60.0
4    50.0
5    59.0
6    21.0
7    98.0
8    40.0
Name: Marks, dtype: float64

In [ ]:
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler()

df['Normalized Marks'] = scaler.fit_transform(df[['Marks']])
print(df)

   Marks  Normalized Marks
0   78.0          0.740260
1   90.0          0.896104
2   35.0          0.181818
3   60.0          0.506494
4   50.0          0.376623
5   59.0          0.493506
6   21.0          0.000000
7   98.0          1.000000
8   40.0          0.246753

In [ ]:
data = {'City':['Mumbai','Navi Mumbai','Thane','Banglore','Hyderabad','Delhi','Pune','Nashik','Chennai']}

df = pd.DataFrame(data)

data_encoded = pd.get_dummies(df,columns=['City'])
print(data_encoded)

   City_Banglore  City_Chennai  City_Delhi  City_Hyderabad  City_Mumbai  \
0          False         False       False           False         True
1          False         False       False           False        False
2          False         False       False           False        False
3           True         False       False           False        False
4          False         False       False            True        False
5          False         False        True           False        False
6          False         False       False           False        False
7          False         False       False           False        False
8          False          True       False           False        False

   City_Nashik  City_Navi Mumbai  City_Pune  City_Thane
0        False             False      False       False
1        False              True      False       False
2        False             False      False        True
3        False             False      False       False
4        False             False      False       False
5        False             False      False       False
6        False             False       True       False
7         True             False      False       False
8        False             False      False       False